[
    "[Humor](emotion) is a really great medium to remove boredom and to start a nice and easy conversation anywhere anytime. Nothing can make you laugh like sharing a few hilarious jokes with your closest [friends](people). Here we present you a wide collection of funny messages for [friends](people) that you can post on Facebook or Whatsapp to [cheer](emotion) them up and make their day shine brighter.",
    "I went to the [Drake](people) concert the other day, I had a lot [fun](emotion)! There was a huge crowd towards the front just jamming to his music. I felt kinda claustrophobic so I moved to the back. The concert lasted 2-3 hours and he played all his classic hits.I met some of my [friends](people) from college there, and we decided to go and grab some food after the concert at a local pizza shop. Overall, I had a great time it was definitely worth going.",
    "I just finished my 2nd dose of Radiation for my cancer [today](date).  It was nerve racking but it went a lot quicker than my appointment [last Friday](date).   For the 2nd appointment it takes longer to get angled on the table correctly versus how long the actual radiation treatment takes so that was a plus at least.",
    "I went [skydiving](event). I jumped from [3000 feet](height) and was in the air for half an hour and then landed on the [beach](landed). it was [wonderful](emotion)",
    "I went to [Delaware](location) to visit [my mother](people), [sisters](people), [brother-in-law](people), [nieces](people), and [nephews](people). It was a pleasant [trip](event). I [enjoyed](emotion) their company. The take out food was [tasty](taste). I hope to go again soon.",
    "[MY SISTER](subject)  [BIRTHDAY](event) IS COMING SOON  YOU WILL COME ATTEND THE PART",
    "I went to this [amazing](emotion) [party](event) [last night](date), and I just had to tell you all about it! The party was held at this really cool [rooftop bar](location) [downtown](location). When I got there, the atmosphere was buzzing with [excitement](emotion). The music was fantastic, and there was an incredible view of the city skyline. I bumped into a lot of [old friends](people) and made some new ones too. We [danced](activity) the night away, and it was just such a [blast](emotion)! I felt so [happy](emotion) and [energized](emotion). It was one of the [best nights](emotion) I've had in a long time.",
    "i hope you are doing great. I'm writing to tell you about an event i attended  in [India](location), it was an [exhibition](event) . There were people from all all over the country selling traditional goods like clothes and bags they are of superior quality nal goods  like handbags ,clothes, and many more.can you believe  everything is of nal goods like handbags ,clothes,footweargoods  likenal goods like handbags ,clothes,footwear",
    "INTENT",
    "I AM GONNA SHARE A [BEAUTIFUL](emotion) AND LONG LASTING MEMORY THAT ALWAYS MADE ME FELT [HAPPIER](emotion), IT WAS A [MARATHON](activity) AND THIS WAS A FIRST TIME EXPERIENCE ALONG WITH MY [FAMILY MEMBERS](people) AND [FRIENDS](people) AND ACTUALLY I WAS THE LAST PERSON TO COMPLETE THE RACE AND EVERYONE OVER IN THE CROWD CHEERED ME A LOT AND THAT MOMENT MADE FEEL LIKE SOMETHING I WAS SO [SPECIAL](emotion) THERE IS NOTHING IN WINNING OR LOSING A GAME ALL IS THAT PARTICIPATION IS IMPORTANT AND I REALLY [LOVED](emotion) THAT A LOT.",
    "[last monday](date), i was at [work](event), when my [boss](people) asked to set up an afternoon meeting with some [suppliers](people) and asked to put a table with breakfast for the participants, but i [completely forgot](emotion) to do it and when the day of the meeting arrived, there was nothing for them to eat, my [boss](people) came to ask me why there was no food on the table, and said that I [forgot](emotion), I felt [very embarrassed](emotion) and ran to the nearest [bakery](location) and bought what was there to serve.",
    "i went to the [store](location) [yesterday](date) and i [hated](emotion) it. I feel [awkward](emotion) being around people since i have a service dog people constantly [stare and make comments](emotion). such a simple task takes so much out of me that i am [mentally drained](emotion) at the end.",
    "[Last Saturday](date) [Josh](people) and [Rachel](people) were [married](event), many of their [close friends](people) and [family](people) were there. The venue was [beautifully](emotion) decorated with a rustic theme. [Josh](people)'s best man [Jacob](people)'s speech was the most [humorous](emotion) speech I have heard yet but I'm assuming the alcohol had a lot to do with that. [Chelsea](people), [Rachel](people)'s maid of honor had a speech truly from the heart mentioning past details they shared together and how [Josh](people) and [Rachel](people) met. This day was [magical](emotion) to say the least and made me feel [excited](emotion) for my own wedding one day.",
    "Dear [friend](people), Gone are the days of laughing, talking, [singing](activity) and [celebrating](activity). I feel [sad](emotion) about it and I want those memories to come back.",
    "You should come to the [farmers market](location). It is a great place to get the freshest local produce!",
    "The other day someone at [work](location) was [fighting](activity). It was [crazy](emotion). There was a big crowd and everyone was [yelling](emotion) and [cheering](emotion). They had to walk the people out.",
    "I just went to a [park-based](location) [outdoor music festival](event). The celebration of the summer's conclusion took place at this amazing event. The attitude was [upbeat](emotion) and [energizing](emotion), and the weather was [ideal](weather).The [park](location) had numerous [stages](location) set up with various bands and performers performing music from various genres. The music on the schedule ranged from jazz and reggae to rock and pop. The bands were all really [talented](emotion) and [energetic](emotion), and the sound quality was [fantastic](emotion).  There were a lot of people in the [park](location), and they were all having a [fantastic](emotion) time. There was a sense of community and camaraderie among those present as they [danced](activity), [sang](activity), and listened to the music together. It was so [enjoyable](emotion) and [welcoming](emotion).",
    "Recently, I helped put together a [portfolio showcase](activity) for local creatives in my [city](location). It was a [lot of work](emotion), but the event itself went well. It was at a [beautiful](emotion) event space [downtown](location), and many people came. I sat at the front and helped sign people in.",
    "Went to a Home Free [concert](event).  It was on [Sunday](date), [February 19th](date) at 7 pm.  I had a [wonderful](emotion) time. Home Free is a group that [sings](active) with out back ground instruments or music.  They performed great.  It was a [nice atmosphere](weather) and we had [terrific](emotion) seats.  I want to go again",
    "I would tell my [friend](people) that I missed her coming to visit me when I was in the [hospital](location) because I missed her presents and was very [lonely](emotion) there.",
    "The [birthday](even) party was organized completely with the F. R.I.E.N.D.S theme. I really [enjoy](emotion) there and everything went according to my plan.",
    "I went to the [town fair](location) the summer and the smell of funnel cakes made me want to buy a dozen. They were lights from all the [games](activity) being played and the sounds of people [laughing](emotion) and having a [good time](emotion). When I finally bought that funnel cake it was [heavenly](emotion) it melted in my mouth.",
    "I had an [amazing time](emotion) at the event [yesterday](date)! The atmosphere was so [vibrant](emotion) and [energetic](emotion), and it was so much [fun](emotion) to be surrounded by so many people who were all [enjoying](emotion) the same thing. I met some great people and made some new [friends](people), too. I was really [impressed](emotion) with how well-organized the whole event was and how everyone was so [friendly](emotion) and [welcoming](emotion). I'm so [glad](emotion) I decided to go, and I can't wait to do it again!",
    "Hello [Jonathan](people), I was in the [forest](location) [today](date) and discovered a high ropes course. There you can climb from one tree to another at a height of 15 meters and then abseil down.",
    "Recently I attended a 'Gala' [Dinner](event) in the [Pegasus Ballroom](located) at the [University of Central Florida](location). This event was advertised to the entire [student](people) population in the weeks prior to this event. Around 700 people showed up to this [dinner](event) with a majority of the people wearing a nice button down with dress pants. The women wore long dresses and/or fancy dresses you would see actresses wear at the red carpet. The meal started off with a serving of [bread](food) and various dips which included, [guacomole](food), [hummus](food), and more. After the bread we were given salads. Soon after was the main meal which consisted of ground beef mixed together with white jasmine rife and a side of cooked squash and zucchini. Once everyone was done getting their food, the speeches occurred. The speeches were given by all of the running parties for the upcoming presidental election. After the speeches were over people decided to get [dessert](food), which was [chochalte](food) [cake](food), or decided to leave.",
    "[Last week](date) I went to NYC to visit my [granddaughter](people) on her [sixth](age) [birthday](event). We had a [cake](food) and some [Dominican food](food). We gave her gifts. We stayed over in a [hotel](location). We had breakfast and left in the morning. It was a [fun](emotion) [trip](vacation).",
    "I attended [Jay](people)'s [funeral](event) in [California](location) [last weekend](date). The turnout was [amazing](emotion), so much more support than we expected. It was [amazing](emotion) to see the huge impact [Jay](people) made on his community.",
    "I went to a [friends](people) [engagement](event) party [yesterday](date). I hadn't gotten to see her in a while, so it was [nice](emotion) to see her looking so well. She looked [happy](emotion) which made me happy. There was great food and music too.",
    "I went to [my son](people)'s [basketball tournament](event) game. It was a [good](emotion) game early on but got out of hand by the end. The opposing team was not very good and [my son](people)'s team was not challenged by them. [My son](people)'s team won the game by 20 points and advanced to the next level.",
    "I went to the [bar](location) last night and it was so [fun](emotion). We had a whole lot of drinks and after that we went out to eat i had a [burger](food) and some [fries](food). It was so [good](emotion).",
    "going to a [concert](event) had just [rained](weather) and there in the mud in the field with 180000 people, we shouted the song that most of all we shared. Its a feeling of union and [fantastic beauty](emotion)"
]


